Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.CurvedDimensionType Property
 The curved dimension type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.CurvedDimensionTypes CurvedDimensionType { get; set; }
Public Property CurvedDimensionType As DimensionSetBaseAttributes.CurvedDimensionTypes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.CurvedDimensionTypes
See Also
Reference
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Class
Tekla.Structures.Drawing Namespace